app/controllers/home_controller.rb

  def index
    @products = Product.all
    @order = Order.where(user_id: current_user.id).where(is_cart: true).count
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."is_cart" = ?  [["user_id", 5], ["is_cart", true]]