app/controllers/userparams_controller.rb

INSERT INTO "userparams" ("firstname", "lastname", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "tester"], ["lastname", "tester"], ["city", "test"], ["user_id", 1], ["created_at", 2017-05-05 12:19:30 UTC], ["updated_at", 2017-05-05 12:19:30 UTC]]
---
  def create
     @userparam = current_user.build_userparam(user_params)
      if @userparam.save

SELECT  "userparams".* FROM "userparams" WHERE "userparams"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def edit
	@userparam = Userparam.find_by_user_id(current_user.id)

SELECT  "userparams".* FROM "userparams" WHERE "userparams"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
UPDATE "userparams" SET "city" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["city", "Kyiv2"], ["updated_at", 2017-05-12 11:49:35 UTC], ["id", 3]]
---
  def update
	@userparam = Userparam.find_by_user_id(current_user.id)
	  if @userparam.update(user_params)